s=set()
dic={}
dic1={}
l1=[]
l2=[]
l3=[]
l4=[]
lit=[]
q1=[]
dic4={}
s1=set()
l10=['ఆడిట్', 'నిర్వహణ', 'ఆడిటర్', 'ఒక', 'కొత్త', 'చేపట్టే', 'ముందు', 'సక్రమ', 'పద్ధతి', 'కార్య', 'ప్రణాళికను',
     'పిలిపించి ', 'మాట్లాడించారు', 'విని', 'పరిహసించినట్లు', 'నవ్వడం', 'ఊరుకున్నారు', 'ఒకరు', 'ఇద్దరు', 'భాషలు',
     'పరిహసిస్తూ', 'మనస్సులో', 'వినపడేట్టు', 'అందరికీ', 'తెలియకపోవడం', 'చెయ్యవలెనో', 'మృగంలో', 'విశేషం', 'కనిపించింది',
     'తొణకదు', 'బెణకదు', 'చుట్టుపట్ల', 'నిరాదరణగా', 'చూస్తుంది', 'ఇంతసేపూ', 'పెట్టుకొని', 'ఇప్పుడు', 'తుపాకిమీద',
     'ఎందుచేత','పంజరాన్ని', 'అంటుకొని', 'నిలుచున్నది', 'సైనికుడు', 'భయపడి', 'వెనుకకు', 'తుపాకి', 'ఎత్తి',
     'పట్టుకొన్నాడు','తిరగడం', 'తటస్థించింది', 'మారణ', 'సాధనం', 'తెలిసికొంది', 'దానివంక', 'సాభిప్రాయంగా', 'చేతికి',
     'ఇమ్మని', 'అడిగింది','ఇవ్వలేదు', 'ఆశ్చర్యపోయి', 'చూశారు', 'క్రుంకింది', 'దారిన', 'వెళ్లిపోతున్నారు','అనవసరం',
     'కొంతమంది', 'పనీ','ఎక్కువని', 'భావించవచ్చు', 'లోపాలను', 'నివారించటానికి', 'కార్యక్రమాన్ని', 'మార్గదర్శిగా',
     'ఎంచవలెనేగాని''కారణ', 'మన్న', 'సంగతి', 'ఎవరికీ', 'ప్రపంచానిక', 'మేలు', 'చేయడాని', 'కని', 'మహానీయులు', 'పుడుతూ',
     'జన్మించిన', 'మహా', 'పురుషులలో', 'మహాశయుడు', 'ఎట్లు', 'సర్దుకుపోవలె', 'అంశాన్ని', 'పరిశీలిస్తుంది', 'రాజకీయాలకు',
     'మనిషే', 'మూలము', 'వ్యక్తికి', 'హక్కులను', 'స్వేచ్ఛలను', 'యిచ్చి', 'చూడటం', 'సంభనించిందన్నారు', 'పోలీసులంటే',
     'భయం', 'సాధ్యమైనంత', 'పోలీసులకు', 'దూరంగా', 'జరిగిందన్నారు', 'విచారణ', 'గ్రామానికి', 'కాలంపాటు', 'తిష్ఠ', 'వేయగా',
     'గ్రామస్తులు', 'అవసరాలు',  'రాజ్యం', 'విధులను', 'నిర్వహిస్తుంది', 'పరస్పర', 'పోషకాలు', 'లేనిదే', 'ఉనికి',
     'సాధ్యంకాదు', 'కారణం', 'చేతనే', 'లాస్కీ', 'మొదలగు', 'చెప్పినారు', 'సిద్ధాంత', 'రాజనీతిశాస్త్రంలో']
for i in l10:
    if i not in lit:
        lit.append(i)
for i in lit:
    if i not in [".", '4', '14', '"', "(",")", "!", "Z", "`", "'", ";"]:
        for x in list(i):
            if x in s:
                if i not in dic[x]:
                    dic[x].append(i)
            else:
                s.add(x)
                dic[x]=[]
                dic[x].append(i)
    else:
        pass
def spellcheck(query):
    q=list(query)
    dup=list(q)
    for i in q:
        if i not in q1:
            q1.append(i)
        else:
            pass
    for i in q1:
        l1 = list(dic[i])
        for j in l1:
            if j in s1:
                dic1[j]+=1
            else:
                s1.add(j)
                dic1[j]=1
        l1.clear()
    print(dic1)
    max_freq=max(dic1.values())
    for key,value in dic1.items():
        if value==max_freq:
            l2.append(key)
    print(max_freq)
    print(l2)
    for word in l2:
        ed=0
        q=list(dup)
        l3=list(word)
        x=y=-1
        for i in range(len(l3)):
            for j in range(len(q)):
                if (l3[i] == q[j]) and (j != y):
                    x = y
                    y = j
                    l = 1
                    if i == (len(l3) - 1):
                        q[y] = "*"
                    else:
                        pass
                    break
                elif (j == (len(q) - 1)):
                    ed = ed + 1
                    l = 0
                else:
                    pass
            if l != 0:
                if x < y:
                    if (x != -1):
                        q[x] = "*"
                        l = 1
                    else:
                        pass
                else:
                    ed = ed + 1
            else:
                pass
        if l == 0:
            q[y] = "*"
        else:
            pass

        for j in q:
            if j != "*":
                ed += 1
        dic4[word]=ed
        l3.clear()
    print(dic4)
    min_ed = min(dic4.values())
    for key, value in dic4.items():
        if value == min_ed:
            print(key)
query=input("enter the mis spelt word\t")
spellcheck(query)
